[Killed] LogicalOperator
main/components/RecommendationRequests/RecommendationRequestForm.js:31:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col md={2}>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">ID</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col md={2}>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">ID</Form.Label>
+              <Form.Control data-testid="RecommendationRequestForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col md={5}>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/RecommendationRequests/RecommendationRequestForm.js:31:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col md={2}>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">ID</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col md={5}>
killedBy: RecommendationRequestForm tests renders correctly when passing in a RecommendationRequest
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:57:26
               isInvalid={Boolean(errors.requesterEmail)}
               {...register("requesterEmail", {
                 required: "Requester email is required.",
-                pattern: {
-                  value: email_regex,
-                  message: "Must be a valid email address.",
-                },
+                pattern: {},
               })}
             />
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<div class="invalid-feedback">Must be a valid email address.</div>]

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:77:46
               id="professorEmail"
               type="email"
               isInvalid={Boolean(errors.professorEmail)}
-              {...register("professorEmail", {
-                required: "Professor email is required.",
-                pattern: {
-                  value: email_regex,
-                  message: "Must be a valid email address.",
-                },
-              })}
+              {...register("professorEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<div class="invalid-feedback">Must be a valid email address.</div>]

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:102:43
               data-testid="RecommendationRequestForm-explanation"
               id="explanation"
               isInvalid={Boolean(errors.explanation)}
-              {...register("explanation", {
-                required: "Explanation is required.",
-                maxLength: {
-                  value: 255,
-                  message: "Explanation cannot exceed 255 characters.",
-                },
-              })}
+              {...register("explanation", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:126:45
               id="dateRequested"
               type="text"
               isInvalid={Boolean(errors.dateRequested)}
-              {...register("dateRequested", {
-                required: "Date requested is required.",
-                pattern: {
-                  value: isodate_regex,
-                  message: "Must be in ISO datetime format.",
-                },
-              })}
+              {...register("dateRequested", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<div class="invalid-feedback">Must be in ISO datetime format.</div>]
