[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:62:16
                 </NavDropdown>
               )}
 
-              {hasRole(currentUser, "ROLE_USER") && (
-                <>
-                  <Nav.Link as={Link} to="/diningcommonsmenuitem">
-                    UCSBDiningCommonsMenuItem
-                  </Nav.Link>
-                </>
-              )}
+              {true}
 
               {currentUser && currentUser.loggedIn ? (
killedBy: AppNavbar tests renders the UCSBDiningCommonsMenuItem link correctly
statusReason: Error: Unable to find an element with the text: UCSBDiningCommonsMenuItem. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavba

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:62:16
                 </NavDropdown>
               )}
 
-              {hasRole(currentUser, "ROLE_USER") && (
-                <>
-                  <Nav.Link as={Link} to="/diningcommonsmenuitem">
-                    UCSBDiningCommonsMenuItem
-                  </Nav.Link>
-                </>
-              )}
+              {false}
 
               {currentUser && currentUser.loggedIn ? (
killedBy: AppNavbar tests renders the UCSBDiningCommonsMenuItem link correctly
statusReason: Error: Unable to find an element with the text: UCSBDiningCommonsMenuItem. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavba
