[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:17:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/recommendationrequests/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: RecommendationRequestTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/recommendationrequests/edit/1"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ArrayDeclaration
main/components/RecommendationRequests/RecommendationRequestTable.js:33:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    { Header: "ID", accessor: "id" },
-    { Header: "Requester Email", accessor: "requesterEmail" },
-    { Header: "Professor Email", accessor: "professorEmail" },
-    { Header: "Explanation", accessor: "explanation" },
-    { Header: "Date Requested", accessor: "dateRequested" },
-    { Header: "Date Needed", accessor: "dateNeeded" },
-    { Header: "Done?", accessor: "done" },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:35:5
 
   const columns = [
     { Header: "ID", accessor: "id" },
-    { Header: "Requester Email", accessor: "requesterEmail" },
+    {},
     { Header: "Professor Email", accessor: "professorEmail" },
     { Header: "Explanation", accessor: "explanation" },
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:36:44
   const columns = [
     { Header: "ID", accessor: "id" },
     { Header: "Requester Email", accessor: "requesterEmail" },
-    { Header: "Professor Email", accessor: "professorEmail" },
+    { Header: "Professor Email", accessor: "" },
     { Header: "Explanation", accessor: "explanation" },
     { Header: "Date Requested", accessor: "dateRequested" },
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-professorEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:39:40
     { Header: "Professor Email", accessor: "professorEmail" },
     { Header: "Explanation", accessor: "explanation" },
     { Header: "Date Requested", accessor: "dateRequested" },
-    { Header: "Date Needed", accessor: "dateNeeded" },
+    { Header: "Date Needed", accessor: "" },
     { Header: "Done?", accessor: "done" },
   ];
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-dateNeeded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:39:15
     { Header: "Professor Email", accessor: "professorEmail" },
     { Header: "Explanation", accessor: "explanation" },
     { Header: "Date Requested", accessor: "dateRequested" },
-    { Header: "Date Needed", accessor: "dateNeeded" },
+    { Header: "", accessor: "dateNeeded" },
     { Header: "Done?", accessor: "done" },
   ];
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date Needed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:40:15
     { Header: "Explanation", accessor: "explanation" },
     { Header: "Date Requested", accessor: "dateRequested" },
     { Header: "Date Needed", accessor: "dateNeeded" },
-    { Header: "Done?", accessor: "done" },
+    { Header: "", accessor: "done" },
   ];
 
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Done?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
