[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:8:22
 
 export default function AppNavbar({ currentUser, systemInfo, doLogout }) {
   const currentUrl = window.location.href;
-  const oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  const oauthLogin = systemInfo?.oauthLogin && "/oauth2/authorization/google";
 
   const showLocalhostBanner =
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: Error: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] OptionalChaining
main/components/Nav/AppNavbar.js:8:22
 
 export default function AppNavbar({ currentUser, systemInfo, doLogout }) {
   const currentUrl = window.location.href;
-  const oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  const oauthLogin = systemInfo.oauthLogin || "/oauth2/authorization/google";
 
   const showLocalhostBanner =
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of undefined (reading 'oauthLogin')

[Killed] MethodExpression
main/components/Nav/AppNavbar.js:11:5
   const oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
 
   const showLocalhostBanner =
-    currentUrl.startsWith("http://localhost:3000") ||
+    currentUrl.endsWith("http://localhost:3000") ||
     currentUrl.startsWith("http://127.0.0.1:3000");
 
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:11:5
   const oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
 
   const showLocalhostBanner =
-    currentUrl.startsWith("http://localhost:3000") ||
-    currentUrl.startsWith("http://127.0.0.1:3000");
+    false;
 
   return (
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] MethodExpression
main/components/Nav/AppNavbar.js:12:5
 
   const showLocalhostBanner =
     currentUrl.startsWith("http://localhost:3000") ||
-    currentUrl.startsWith("http://127.0.0.1:3000");
+    currentUrl.endsWith("http://127.0.0.1:3000");
 
   return (
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://127.0.0.1:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] StringLiteral
main/components/Nav/AppNavbar.js:12:27
 
   const showLocalhostBanner =
     currentUrl.startsWith("http://localhost:3000") ||
-    currentUrl.startsWith("http://127.0.0.1:3000");
+    currentUrl.startsWith("");
 
   return (
killedBy: AppNavbar tests does NOT render the AppNavbarLocalhost when on localhost:8080
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="/AppNavbarLocalhost/i"]

Here are the matching elements:

Ignored nodes: comments, script, style
<nav
  class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
  data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:16:8
 
   return (
     <>
-      {showLocalhostBanner && <AppNavbarLocalhost url={currentUrl} />}
+      {true}
 
       <Navbar
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:16:8
 
   return (
     <>
-      {showLocalhostBanner && <AppNavbarLocalhost url={currentUrl} />}
+      {showLocalhostBanner || <AppNavbarLocalhost url={currentUrl} />}
 
       <Navbar
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:51:16
             {/* Center/left navigation */}
             <Nav className="mr-auto">
               {/* Admin dropdown */}
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
 
               {/* Logged-in user links */}
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:51:16
             {/* Center/left navigation */}
             <Nav className="mr-auto">
               {/* Admin dropdown */}
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
+                </NavDropdown>}
 
               {/* Logged-in user links */}
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] OptionalChaining
main/components/Nav/AppNavbar.js:62:16
               )}
 
               {/* Logged-in user links */}
-              {currentUser?.loggedIn && (
+              {currentUser.loggedIn && (
                 <>
                   <Nav.Link as={Link} to="/articles">
killedBy: AppNavbar tests Restaurant and UCSBDates links do NOT show when not logged in
statusReason: TypeError: Cannot read properties of null (reading 'loggedIn')
