[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:10:47
 }
 // Stryker restore next-line all
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    // Stryker disable next-line all
-    url: "/api/recommendationrequests",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 // Stryker restore next-line all
 
killedBy: RecommendationRequestTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
