[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:12:22
   doLogout,
   currentUrl = window.location.href,
 }) {
-  const oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  const oauthLogin = false;
 
   return (
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: Error: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:12:22
   doLogout,
   currentUrl = window.location.href,
 }) {
-  const oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  const oauthLogin = systemInfo?.oauthLogin && "/oauth2/authorization/google";
 
   return (
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: Error: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:36:14
           <Navbar.Toggle />
 
           <Nav className="me-auto">
-            {systemInfo?.springH2ConsoleEnabled && (
-              <Nav.Link href="/h2-console">H2Console</Nav.Link>
-            )}
+            {false}
             {systemInfo?.showSwaggerUILink && (
               <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:39:14
             {systemInfo?.springH2ConsoleEnabled && (
               <Nav.Link href="/h2-console">H2Console</Nav.Link>
             )}
-            {systemInfo?.showSwaggerUILink && (
-              <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
-            )}
+            {false}
           </Nav>
 
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Swagger. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNa

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:39:14
             {systemInfo?.springH2ConsoleEnabled && (
               <Nav.Link href="/h2-console">H2Console</Nav.Link>
             )}
-            {systemInfo?.showSwaggerUILink && (
-              <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
-            )}
+            {true}
           </Nav>
 
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Swagger. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNa

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:46:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
+                </NavDropdown>}
 
               {currentUser?.loggedIn && (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] OptionalChaining
main/components/Nav/AppNavbar.js:56:16
                 </NavDropdown>
               )}
 
-              {currentUser?.loggedIn && (
+              {currentUser.loggedIn && (
                 <>
                   <Nav.Link as={Link} to="/articles">
killedBy: AppNavbar tests Restaurant and UCSBDates links do NOT show when not logged in
statusReason: TypeError: Cannot read properties of null (reading 'loggedIn')

[Killed] OptionalChaining
main/components/Nav/AppNavbar.js:90:16
             </Nav>
 
             <Nav className="ml-auto">
-              {currentUser?.loggedIn ? (
+              {currentUser.loggedIn ? (
                 <>
                   <Navbar.Text className="me-3" as={Link} to="/profile">
killedBy: AppNavbar tests Restaurant and UCSBDates links do NOT show when not logged in
statusReason: TypeError: Cannot read properties of null (reading 'loggedIn')
