[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:19:30
     },
   });
 
-  const onSuccess = (org) => {
-    toast(
-      `New UCSB Organization Created — orgCode: ${org.orgCode} orgTranslationShort: ${org.orgTranslationShort}`,
-    );
-  };
+  const onSuccess = (org) => {};
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, [
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New UCSB Organization Created — orgCode: ACM orgTranslationShort: Association Comp Machine"

Number of calls: 0
