[Survived] ArrayDeclaration
main/pages/UCSBOrganizations/UCSBOrganizationsIndexPage.js:12:5
   const currentUser = useCurrentUser();
 
   const { data: ucsborganizations } = useBackend(
-    ["/api/ucsborganizations/all"],
+    [],
     { method: "GET", url: "/api/ucsborganizations/all" },
     [],

[Survived] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsIndexPage.js:12:6
   const currentUser = useCurrentUser();
 
   const { data: ucsborganizations } = useBackend(
-    ["/api/ucsborganizations/all"],
+    [""],
     { method: "GET", url: "/api/ucsborganizations/all" },
     [],

[Survived] ArrayDeclaration
main/pages/UCSBOrganizations/UCSBOrganizationsIndexPage.js:14:5
   const { data: ucsborganizations } = useBackend(
     ["/api/ucsborganizations/all"],
     { method: "GET", url: "/api/ucsborganizations/all" },
-    [],
+    ["Stryker was here"],
   );
 
