[Killed] BlockStatement
src/main/utils/ucsbOrganizationsUtils.js:3:42
 import { toast } from "react-toastify";
 
-export function onDeleteSuccess(message) {
-  toast(message);
-}
+export function onDeleteSuccess(message) {}
 
 export function cellToAxiosParamsDelete(cell) {
killedBy: ucsboOrganizationsUtils onDeleteSuccess logs and toasts the message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "abc"

Number of calls: 0
