[Killed] BlockStatement
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsborganizations/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : backend mutation caching makes this hard to test
killedBy: UCSBOrganizationsTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsborganizations/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:41:5
       Header: "id",
       accessor: "id",
     },
-    {
-      Header: "Organization Code",
-      accessor: "orgCode",
-    },
+    {},
     {
       Header: "Organization Translation Short",
killedBy: UCSBOrganizationsTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:42:15
       accessor: "id",
     },
     {
-      Header: "Organization Code",
+      Header: "",
       accessor: "orgCode",
     },
killedBy: UCSBOrganizationsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Organization Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:50:15
       accessor: "orgTranslationShort",
     },
     {
-      Header: "Organization Translation",
+      Header: "",
       accessor: "orgTranslation",
     },
killedBy: UCSBOrganizationsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Organization Translation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="t
