[Killed] BooleanLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:7:67
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBOrganizationsCreatePage({ storybook = false }) {
+export default function UCSBOrganizationsCreatePage({ storybook = true }) {
   const objectToAxiosParams = (org) => ({
     url: "/api/ucsborganizations/post",
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request and navigates to /ucsborganizations
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: {"to": "/ucsborganizations"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function UCSBOrganizationsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (org) => ({
-    url: "/api/ucsborganizations/post",
-    method: "POST",
-    params: {
-      orgCode: org.orgCode,
-      orgTranslationShort: org.orgTranslationShort,
-      orgTranslation: org.orgTranslation,
-      inactive: org.inactive,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (org) => {
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request and navigates to /ucsborganizations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:10:13
 export default function UCSBOrganizationsCreatePage({ storybook = false }) {
   const objectToAxiosParams = (org) => ({
     url: "/api/ucsborganizations/post",
-    method: "POST",
+    method: "",
     params: {
       orgCode: org.orgCode,
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request and navigates to /ucsborganizations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:11:13
   const objectToAxiosParams = (org) => ({
     url: "/api/ucsborganizations/post",
     method: "POST",
-    params: {
-      orgCode: org.orgCode,
-      orgTranslationShort: org.orgTranslationShort,
-      orgTranslation: org.orgTranslation,
-      inactive: org.inactive,
-    },
+    params: {},
   });
 
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request and navigates to /ucsborganizations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "inactive": true,
-   "orgCode": "ACM",

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:19:30
     },
   });
 
-  const onSuccess = (org) => {
-    toast(`New organization Created - id: ${org.id} orgCode: ${org.orgCode}`);
-  };
+  const onSuccess = (org) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request and navigates to /ucsborganizations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New organization Created - id: 4 orgCode: ACM"

Number of calls: 0
