[Killed] BooleanLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:7:65
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBOrganizationsEditPage({ storybook = false }) {
+export default function UCSBOrganizationsEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: UCSBOrganizationsEditPage tests when backend works normally loads data and updates form
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/ucsborganizations"}

Number of calls: 0

[Survived] ArrayDeclaration
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:14:18
     data: org,
     _error,
     _status,
-  } = useBackend([`/api/ucsborganizations?id=${id}`], {
+  } = useBackend([], {
     method: "GET",
     url: "/api/ucsborganizations",

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:16:10
     _status,
   } = useBackend([`/api/ucsborganizations?id=${id}`], {
     method: "GET",
-    url: "/api/ucsborganizations",
+    url: "",
     params: { id },
   });
killedBy: UCSBOrganizationsEditPage tests when backend works normally loads data and updates form
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationsForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:20:34
     params: { id },
   });
 
-  const objectToAxiosPutParams = (org) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: { id: org.id },
-    data: {
-      orgCode: org.orgCode,
-      orgTranslationShort: org.orgTranslationShort,
-      orgTranslation: org.orgTranslation,
-      inactive: org.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (org) => {
killedBy: UCSBOrganizationsEditPage tests when backend works normally loads data and updates form
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Organization Updated - id: 17 orgCode: ACM1"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:20:44
     params: { id },
   });
 
-  const objectToAxiosPutParams = (org) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: { id: org.id },
-    data: {
-      orgCode: org.orgCode,
-      orgTranslationShort: org.orgTranslationShort,
-      orgTranslation: org.orgTranslation,
-      inactive: org.inactive,
-    },
-  });
+  const objectToAxiosPutParams = (org) => ({});
 
   const onSuccess = (org) => {
killedBy: UCSBOrganizationsEditPage tests when backend works normally loads data and updates form
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Organization Updated - id: 17 orgCode: ACM1"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:24:11
     url: "/api/ucsborganizations",
     method: "PUT",
     params: { id: org.id },
-    data: {
-      orgCode: org.orgCode,
-      orgTranslationShort: org.orgTranslationShort,
-      orgTranslation: org.orgTranslation,
-      inactive: org.inactive,
-    },
+    data: {},
   });
 
killedBy: UCSBOrganizationsEditPage tests when backend works normally loads data and updates form
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "inactive": true,
-   "orgCode": "ACM1",

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:32:30
     },
   });
 
-  const onSuccess = (org) => {
-    toast(`Organization Updated - id: ${org.id} orgCode: ${org.orgCode}`);
-  };
+  const onSuccess = (org) => {};
 
   const mutation = useBackendMutation(objectToAxiosPutParams, { onSuccess }, [
killedBy: UCSBOrganizationsEditPage tests when backend works normally loads data and updates form
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:37:5
   };
 
   const mutation = useBackendMutation(objectToAxiosPutParams, { onSuccess }, [
-    `/api/ucsborganizations?id=${id}`,
+    ``,
   ]);
 

[Killed] LogicalOperator
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:54:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Organization</h1>
-        {org && (
-          <UCSBOrganizationsForm
-            submitAction={onSubmit}
-            buttonLabel="Update"
-            initialContents={org}
-          />
-        )}
+        {org || <UCSBOrganizationsForm submitAction={onSubmit} buttonLabel="Update" initialContents={org} />}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationsEditPage tests when backend doesn't return data renders header but form doesn't appear
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="UCSBOrganizationsForm-orgCode" id="orgCode" name="orgCode" type="text" /> instead

[Killed] ConditionalExpression
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:54:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Organization</h1>
-        {org && (
-          <UCSBOrganizationsForm
-            submitAction={onSubmit}
-            buttonLabel="Update"
-            initialContents={org}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationsEditPage tests when backend works normally loads data and updates form
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationsForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
