[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:30:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid="ArticlesForm-id"
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: ArticlesForm tests renders correctly when passing in an Article
statusReason: Error: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:69:22
           isInvalid={Boolean(errors.url)}
           {...register("url", {
             required: "URL is required.",
-            pattern: {
-              value:
-                /^https?:\/\/[a-z0-9][-a-z0-9.+]*[a-z0-9]\.[a-z0-9][-a-z0-9.+]*[a-z0-9]/i,
-              message: "URL must start with http:// or https://",
-            },
+            pattern: {},
           })}
         />
killedBy: ArticlesForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /URL must start with http:\/\/ or https:\/\//. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] Regex
main/components/Articles/ArticlesForm.js:71:17
             required: "URL is required.",
             pattern: {
               value:
-                /^https?:\/\/[a-z0-9][-a-z0-9.+]*[a-z0-9]\.[a-z0-9][-a-z0-9.+]*[a-z0-9]/i,
+                /^https?:\/\/[a-z0-9][-a-z0-9.+]*[a-z0-9]\.[^a-z0-9][-a-z0-9.+]*[a-z0-9]/i,
               message: "URL must start with http:// or https://",
             },
killedBy: ArticlesForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] Regex
main/components/Articles/ArticlesForm.js:71:17
             required: "URL is required.",
             pattern: {
               value:
-                /^https?:\/\/[a-z0-9][-a-z0-9.+]*[a-z0-9]\.[a-z0-9][-a-z0-9.+]*[a-z0-9]/i,
+                /^https?:\/\/[a-z0-9][^-a-z0-9.+]*[a-z0-9]\.[a-z0-9][-a-z0-9.+]*[a-z0-9]/i,
               message: "URL must start with http:// or https://",
             },
killedBy: ArticlesForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:104:33
           id="email"
           type="email"
           isInvalid={Boolean(errors.email)}
-          {...register("email", {
-            required: "Email is required.",
-            pattern: {
-              value:
-                /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9][a-zA-Z0-9.-]*\.[a-zA-Z]{2,}$/,
-              message: "Invalid email address",
-            },
-          })}
+          {...register("email", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Invalid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] Regex
main/components/Articles/ArticlesForm.js:108:17
             required: "Email is required.",
             pattern: {
               value:
-                /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9][a-zA-Z0-9.-]*\.[a-zA-Z]{2,}$/,
+                /^[a-zA-Z0-9._%+-]+@[^a-zA-Z0-9][a-zA-Z0-9.-]*\.[a-zA-Z]{2,}$/,
               message: "Invalid email address",
             },
killedBy: ArticlesForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] Regex
main/components/Articles/ArticlesForm.js:108:17
             required: "Email is required.",
             pattern: {
               value:
-                /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9][a-zA-Z0-9.-]*\.[a-zA-Z]{2,}$/,
+                /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9][a-zA-Z0-9.-]*\.[^a-zA-Z]{2,}$/,
               message: "Invalid email address",
             },
killedBy: ArticlesForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:109:24
             pattern: {
               value:
                 /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9][a-zA-Z0-9.-]*\.[a-zA-Z]{2,}$/,
-              message: "Invalid email address",
+              message: "",
             },
           })}
killedBy: ArticlesForm tests Correct Error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Invalid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
