[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:38:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid="ArticlesForm-id"
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: ArticlesForm tests renders correctly when passing in an Article
statusReason: Error: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:38:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid="ArticlesForm-id"
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control data-testid="ArticlesForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: ArticlesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:75:31
           id="url"
           type="url"
           isInvalid={Boolean(errors.url)}
-          {...register("url", {
-            required: "URL is required.",
-            pattern: {
-              value: url_regex,
-              message: "URL must start with http:// or https://",
-            },
-          })}
+          {...register("url", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /URL must start with http:\/\/ or https:\/\//. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:77:22
           isInvalid={Boolean(errors.url)}
           {...register("url", {
             required: "URL is required.",
-            pattern: {
-              value: url_regex,
-              message: "URL must start with http:// or https://",
-            },
+            pattern: {},
           })}
         />
killedBy: ArticlesForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /URL must start with http:\/\/ or https:\/\//. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:111:33
           id="email"
           type="email"
           isInvalid={Boolean(errors.email)}
-          {...register("email", {
-            required: "Email is required.",
-            pattern: {
-              value: email_regex,
-              message: "Invalid email address",
-            },
-          })}
+          {...register("email", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Invalid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:113:22
           isInvalid={Boolean(errors.email)}
           {...register("email", {
             required: "Email is required.",
-            pattern: {
-              value: email_regex,
-              message: "Invalid email address",
-            },
+            pattern: {},
           })}
         />
killedBy: ArticlesForm tests Correct Error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Invalid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
