[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:39:17
   const columns = [
     {
       Header: "id",
-      accessor: "id",
+      accessor: "",
     },
     {
killedBy: ArticlesTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
