[Killed] ObjectLiteral
src/main/utils/articlesUtils.js:1:22
-const articleUtils = {
-  url: "/api/articles",
-};
+const articleUtils = {};
 
 export function onDeleteSuccess(message) {
killedBy: articlesUtils tests articleUtils has the correct URL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/articles"
Received: undefined

[Killed] StringLiteral
src/main/utils/articlesUtils.js:2:8
 const articleUtils = {
-  url: "/api/articles",
+  url: "",
 };
 
killedBy: articlesUtils tests articleUtils has the correct URL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/articles"
Received: ""

[Killed] BlockStatement
src/main/utils/articlesUtils.js:5:42
   url: "/api/articles",
 };
 
-export function onDeleteSuccess(message) {
-  console.log(message);
-}
+export function onDeleteSuccess(message) {}
 
 export function cellToAxiosParamsDelete(cell) {
killedBy: articlesUtils tests onDeleteSuccess logs the message to console
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Article deleted successfully"

Number of calls: 0
