[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:33:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid="MenuItemReviewForm-id"
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control data-testid="MenuItemReviewForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+        </Form.Group>}
       <Col>
         <Form.Group className="mb-3">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:53:26
             data-testid="MenuItemReviewForm-itemId"
             id="itemId"
             type="text"
-            {...register("itemId", {
+            {...register("", {
               required: "Item ID is required.",
             })}
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:53:36
             data-testid="MenuItemReviewForm-itemId"
             id="itemId"
             type="text"
-            {...register("itemId", {
-              required: "Item ID is required.",
-            })}
+            {...register("itemId", {})}
           />
           <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Item ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:71:43
             id="reviewerEmail"
             type="text"
             isInvalid={Boolean(errors.reviewerEmail)}
-            {...register("reviewerEmail", {
-              required: "Reviewer email is required.",
-            })}
+            {...register("reviewerEmail", {})}
           />
           <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:95:14
             })}
           />
           <Form.Control.Feedback type="invalid">
-            {errors.stars && "Stars are required. "}
+            {false}
             {errors.stars?.type === "pattern" &&
               "Stars must be within the range of 1-5."}
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:95:14
             })}
           />
           <Form.Control.Feedback type="invalid">
-            {errors.stars && "Stars are required. "}
+            {errors.stars || "Stars are required. "}
             {errors.stars?.type === "pattern" &&
               "Stars must be within the range of 1-5."}
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] EqualityOperator
main/components/MenuItemReview/MenuItemReviewForm.js:96:14
           />
           <Form.Control.Feedback type="invalid">
             {errors.stars && "Stars are required. "}
-            {errors.stars?.type === "pattern" &&
+            {errors.stars?.type !== "pattern" &&
               "Stars must be within the range of 1-5."}
           </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Stars must be within the range of 1-5.</div> instead

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:96:14
           />
           <Form.Control.Feedback type="invalid">
             {errors.stars && "Stars are required. "}
-            {errors.stars?.type === "pattern" &&
-              "Stars must be within the range of 1-5."}
+            {false}
           </Form.Control.Feedback>
         </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Stars must be within the range of 1-5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
