[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:36:17
   const columns = [
     {
       Header: "Id",
-      accessor: "id", // accessor is the "key" in the data
+      accessor: "", // accessor is the "key" in the data
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
