[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:34:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDiningCommonsMenuItem-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="UCSBDiningCommonsMenuItem-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:34:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDiningCommonsMenuItem-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly when passing in a UCSBDiningCommonsMenuItem
statusReason: Error: Unable to find an element by: [data-testid="/UCSBDiningCommonsMenuItem-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:60:49
               id="diningCommonsCode"
               type="text"
               isInvalid={Boolean(errors.diningCommonsCode)}
-              {...register("diningCommonsCode", {
-                required: true,
-              })}
+              {...register("diningCommonsCode", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: DiningCommonsCode is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:65:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.diningCommonsCode && "DiningCommonsCode is required."}
+              {true}
               {/* {errors.diningCommonsCode?.type ===
                 "DiningCommonsCode must be in the format of a string."} */}
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: DiningCommonsCode is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
